OctoberProject3/fio/rand_mix_sweep_result.txt
randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
randwrite: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
rand7030: (g=2): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
rand3070: (g=3): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
rand5050: (g=4): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.36
Starting 5 processes
3;fio-3.36;randread;0;0;57689048;961468;240367;60001;0;1834;1.031886;0.826995;13;4249;65.341456;23.238968;95.000000%=108;99.000000%=142;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;14;4249;66.373341;23.256365;901248;986128;100.000000%;962237.378151;22848.640337;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;12.278333%;40.160000%;6942907;0;28;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.01%;17.53%;75.02%;7.42%;0.03%;0.01%;0.01%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;26127643;37457895;0;143;3482360;792110;4274490;71.41%
3;fio-3.36;randwrite;1;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;95.000000%=0;99.000000%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;107245032;1787387;446846;60001;0;232;1.179382;1.007326;14;6788;34.434131;126.690968;95.000000%=31;99.000000%=140;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;15;6788;35.613513;126.686339;1615184;1896424;100.000000%;1788610.436975;69143.228763;19.220000%;55.575000%;132155;0;12;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.01%;97.26%;1.18%;0.94%;0.17%;0.05%;0.05%;0.27%;0.04%;0.03%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;26127643;37457895;0;143;3482360;792110;4274490;71.41%
3;fio-3.36;rand7030;2;0;29337920;488957;122239;60001;0;919;0.971769;0.774304;15;99907;120.170776;159.712132;95.000000%=296;99.000000%=493;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;20;99909;121.142545;159.726152;263784;706589;100.000000%;489565.084034;120504.332009;12565104;209414;52353;60001;0;635;1.083915;0.796486;0;99644;21.025874;149.378702;95.000000%=48;99.000000%=60;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;6;99647;22.109789;149.382679;113032;302024;100.000000%;209684.781513;51491.608121;8.756667%;25.291667%;3168173;0;16;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.01%;0.01%;12.01%;2.40%;16.29%;42.32%;21.75%;4.58%;0.51%;0.10%;0.03%;0.01%;0.01%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;26127643;37457895;0;143;3482360;792110;4274490;71.41%
3;fio-3.36;rand3070;3;0;9409908;156829;39207;60001;0;237;0.987737;0.846854;24;62326;350.822719;321.112772;95.000000%=823;99.000000%=1138;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;45;62327;351.810457;321.137105;91246;319655;100.000000%;156912.092437;66341.642087;21940004;365660;91415;60001;0;221;1.077303;0.908302;0;62284;22.765454;89.631860;95.000000%=57;99.000000%=84;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;6;62286;23.842757;89.635484;210501;743975;100.000000%;365850.983193;154810.837948;6.953333%;19.636667%;2495243;0;15;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.01%;0.01%;24.01%;6.31%;34.26%;10.66%;8.81%;8.24%;5.42%;1.74%;0.49%;0.03%;0.04%;0.01%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;26127643;37457895;0;143;3482360;792110;4274490;71.41%
3;fio-3.36;rand5050;4;0;8074396;134571;33642;60001;0;868;1.100651;1.100987;43;195366;451.307045;419.457765;95.000000%=847;99.000000%=1089;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;44;195368;452.407696;419.467050;117744;340424;100.000000%;134745.647059;36751.318229;8083388;134720;33680;60001;0;803;1.207123;1.141067;0;195075;21.453913;434.178237;95.000000%=50;99.000000%=88;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;0%=0;6;195092;22.661036;434.190414;118136;340616;100.000000%;134876.865546;36589.393213;4.351667%;12.506667%;2037051;0;15;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.01%;0.01%;21.30%;4.20%;22.05%;4.64%;8.22%;20.59%;14.17%;3.95%;0.84%;0.02%;0.02%;0.00%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;nvme0n1;26127643;37457895;0;143;3482360;792110;4274490;71.41%

randread: (groupid=0, jobs=1): err= 0: pid=63730: Wed Oct  1 18:57:54 2025
  read: IOPS=240k, BW=939MiB/s (985MB/s)(55.0GiB/60001msec)
    slat (nsec): min=689, max=1834.9k, avg=1031.89, stdev=826.99
    clat (usec): min=13, max=4249, avg=65.34, stdev=23.24
     lat (usec): min=14, max=4249, avg=66.37, stdev=23.26
    clat percentiles (usec):
     |  95th=[  109],  99th=[  143]
   bw (  KiB/s): min=901248, max=986128, per=100.00%, avg=962237.38, stdev=22848.64, samples=119
   iops        : min=225312, max=246532, avg=240559.21, stdev=5712.13, samples=119
  lat (usec)   : 20=0.01%, 50=17.53%, 100=75.02%, 250=7.42%, 500=0.03%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=12.28%, sys=40.16%, ctx=6942907, majf=0, minf=28
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=14422262,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
randwrite: (groupid=1, jobs=1): err= 0: pid=64020: Wed Oct  1 18:57:54 2025
  write: IOPS=447k, BW=1745MiB/s (1830MB/s)(102GiB/60001msec); 0 zone resets
    slat (nsec): min=697, max=232174, avg=1179.38, stdev=1007.33
    clat (usec): min=14, max=6788, avg=34.43, stdev=126.69
     lat (usec): min=15, max=6788, avg=35.61, stdev=126.69
    clat percentiles (usec):
     |  95th=[   32],  99th=[  141]
   bw (  MiB/s): min= 1577, max= 1851, per=100.00%, avg=1746.69, stdev=67.52, samples=119
   iops        : min=403796, max=474106, avg=447152.48, stdev=17285.81, samples=119
  lat (usec)   : 20=0.01%, 50=97.26%, 100=1.18%, 250=0.94%, 500=0.17%
  lat (usec)   : 750=0.05%, 1000=0.05%
  lat (msec)   : 2=0.27%, 4=0.04%, 10=0.03%
  cpu          : usr=19.22%, sys=55.58%, ctx=132155, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,26811258,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
rand7030: (groupid=2, jobs=1): err= 0: pid=64299: Wed Oct  1 18:57:54 2025
  read: IOPS=122k, BW=477MiB/s (501MB/s)(28.0GiB/60001msec)
    slat (nsec): min=683, max=919298, avg=971.77, stdev=774.30
    clat (usec): min=15, max=99907, avg=120.17, stdev=159.71
     lat (usec): min=20, max=99909, avg=121.14, stdev=159.73
    clat percentiles (usec):
     |  95th=[  297],  99th=[  494]
   bw (  KiB/s): min=263784, max=706589, per=100.00%, avg=489565.08, stdev=120504.33, samples=119
   iops        : min=65946, max=176647, avg=122391.12, stdev=30126.08, samples=119
  write: IOPS=52.4k, BW=205MiB/s (214MB/s)(12.0GiB/60001msec); 0 zone resets
    slat (nsec): min=711, max=635773, avg=1083.92, stdev=796.49
    clat (nsec): min=233, max=99645k, avg=21025.87, stdev=149378.70
     lat (usec): min=6, max=99647, avg=22.11, stdev=149.38
    clat percentiles (nsec):
     |  95th=[48896],  99th=[60672]
   bw (  KiB/s): min=113032, max=302024, per=100.00%, avg=209684.78, stdev=51491.61, samples=119
   iops        : min=28258, max=75506, avg=52421.08, stdev=12872.93, samples=119
  lat (nsec)   : 250=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=12.01%, 20=2.40%, 50=16.29%
  lat (usec)   : 100=42.32%, 250=21.75%, 500=4.58%, 750=0.51%, 1000=0.10%
  lat (msec)   : 2=0.03%, 4=0.01%, 10=0.01%, 100=0.01%
  cpu          : usr=8.76%, sys=25.29%, ctx=3168173, majf=0, minf=16
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7334480,3141276,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
rand3070: (groupid=3, jobs=1): err= 0: pid=64626: Wed Oct  1 18:57:54 2025
  read: IOPS=39.2k, BW=153MiB/s (161MB/s)(9189MiB/60001msec)
    slat (nsec): min=684, max=237828, avg=987.74, stdev=846.85
    clat (usec): min=24, max=62326, avg=350.82, stdev=321.11
     lat (usec): min=45, max=62327, avg=351.81, stdev=321.14
    clat percentiles (usec):
     |  95th=[  824],  99th=[ 1139]
   bw (  KiB/s): min=91246, max=319655, per=100.00%, avg=156912.09, stdev=66341.64, samples=119
   iops        : min=22811, max=79913, avg=39227.87, stdev=16585.40, samples=119
  write: IOPS=91.4k, BW=357MiB/s (374MB/s)(20.9GiB/60001msec); 0 zone resets
    slat (nsec): min=703, max=221112, avg=1077.30, stdev=908.30
    clat (nsec): min=210, max=62285k, avg=22765.45, stdev=89631.86
     lat (usec): min=6, max=62286, avg=23.84, stdev=89.64
    clat percentiles (nsec):
     |  95th=[57600],  99th=[84480]
   bw (  KiB/s): min=210501, max=743975, per=100.00%, avg=365850.98, stdev=154810.84, samples=119
   iops        : min=52625, max=185993, avg=91462.59, stdev=38702.69, samples=119
  lat (nsec)   : 250=0.01%, 500=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=24.01%, 20=6.31%, 50=34.26%
  lat (usec)   : 100=10.66%, 250=8.81%, 500=8.24%, 750=5.42%, 1000=1.74%
  lat (msec)   : 2=0.49%, 4=0.03%, 10=0.04%, 20=0.01%, 100=0.01%
  cpu          : usr=6.95%, sys=19.64%, ctx=2495243, majf=0, minf=15
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2352477,5485001,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
rand5050: (groupid=4, jobs=1): err= 0: pid=64949: Wed Oct  1 18:57:54 2025
  read: IOPS=33.6k, BW=131MiB/s (138MB/s)(7885MiB/60001msec)
    slat (nsec): min=691, max=868721, avg=1100.65, stdev=1100.99
    clat (usec): min=43, max=195366, avg=451.31, stdev=419.46
     lat (usec): min=44, max=195368, avg=452.41, stdev=419.47
    clat percentiles (usec):
     |  95th=[  848],  99th=[ 1090]
   bw (  KiB/s): min=117744, max=340424, per=100.00%, avg=134745.65, stdev=36751.32, samples=119
   iops        : min=29436, max=85106, avg=33686.41, stdev=9187.83, samples=119
  write: IOPS=33.7k, BW=132MiB/s (138MB/s)(7894MiB/60001msec); 0 zone resets
    slat (nsec): min=709, max=803934, avg=1207.12, stdev=1141.07
    clat (nsec): min=263, max=195076k, avg=21453.91, stdev=434178.24
     lat (usec): min=6, max=195092, avg=22.66, stdev=434.19
    clat percentiles (nsec):
     |  95th=[50944],  99th=[88576]
   bw (  KiB/s): min=118136, max=340616, per=100.00%, avg=134876.87, stdev=36589.39, samples=119
   iops        : min=29534, max=85154, avg=33719.21, stdev=9147.34, samples=119
  lat (nsec)   : 500=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=21.30%, 20=4.20%, 50=22.05%
  lat (usec)   : 100=4.64%, 250=8.22%, 500=20.59%, 750=14.17%, 1000=3.95%
  lat (msec)   : 2=0.84%, 4=0.02%, 10=0.02%, 250=0.01%
  cpu          : usr=4.35%, sys=12.51%, ctx=2037051, majf=0, minf=15
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2018599,2020847,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=939MiB/s (985MB/s), 939MiB/s-939MiB/s (985MB/s-985MB/s), io=55.0GiB (59.1GB), run=60001-60001msec

Run status group 1 (all jobs):
  WRITE: bw=1745MiB/s (1830MB/s), 1745MiB/s-1745MiB/s (1830MB/s-1830MB/s), io=102GiB (110GB), run=60001-60001msec

Run status group 2 (all jobs):
   READ: bw=477MiB/s (501MB/s), 477MiB/s-477MiB/s (501MB/s-501MB/s), io=28.0GiB (30.0GB), run=60001-60001msec
  WRITE: bw=205MiB/s (214MB/s), 205MiB/s-205MiB/s (214MB/s-214MB/s), io=12.0GiB (12.9GB), run=60001-60001msec

Run status group 3 (all jobs):
   READ: bw=153MiB/s (161MB/s), 153MiB/s-153MiB/s (161MB/s-161MB/s), io=9189MiB (9636MB), run=60001-60001msec
  WRITE: bw=357MiB/s (374MB/s), 357MiB/s-357MiB/s (374MB/s-374MB/s), io=20.9GiB (22.5GB), run=60001-60001msec

Run status group 4 (all jobs):
   READ: bw=131MiB/s (138MB/s), 131MiB/s-131MiB/s (138MB/s-138MB/s), io=7885MiB (8268MB), run=60001-60001msec
  WRITE: bw=132MiB/s (138MB/s), 132MiB/s-132MiB/s (138MB/s-138MB/s), io=7894MiB (8277MB), run=60001-60001msec

Disk stats (read/write):
  nvme0n1: ios=26127643/37457895, sectors=209127072/299665424, merge=0/143, ticks=3482360/792110, in_queue=4274490, util=71.41%